SuffRegular = {
                'く': 0,
                'れた': 0,
                'る': 0
                }
SuffPolite = {
                'です': 0,
                'でした':0,
                'ます': 0,
                'ました': 0,
                'どう': 0
                }
SuffHonorific = {
                    'になる': 0,
                    'なさる': 0,
                    'なります': 0,
                    'なりました': 0,
                    'いかがでした': 0,
                    'なさいます': 0,
                    'いらっしゃる': 0,
                    'いらっしゃいます': 0,
                    'られ': 0,
                    'れ': 0,
                    'さい': 0
                    }
SuffHumble = {
                'する': 0,
                'いたす': 0,
                'します': 0,
                'しました': 0,
                'いたします': 0,
                'ております': 0,
                'ります': 0
                }

RootsVerbsHonorific = {
                        'いらっしゃ': 0,
                        'おいでになる': 0,
                        'ご覧にな': 0,
                        '召し上が': 0,
                        '上が': 0,
                        'なさ': 0,
                        'おっしゃ': 0,
                        'ご存じ': 0,
                        '下さ': 0,
                        'お休みにな': 0,
                        'おなくなりにな': 0
                        }
RootsVerbsHumble = {
                        '参': 0,
                        '伺': 0,
                        '拝見': 0,
                        'ご覧にいれ': 0,
                        'いただ': 0,
                        'いた': 0,
                        '申': 0,
                        '申し上げ': 0,
                        'ござ': 0,
                        'お聞きす': 0,
                        '存じ': 0,
                        '差し上げ': 0,
                        'お目にかか': 0
                        }
